/*
 * -- 1 --
 * Написать (текстом) по 2 возможных варианта использования паттерна стратегия и паттерна шаблонный метод в игре.
 * Это поможет лучше проработать понимание того, для чего и когда используются эти паттерны.
 *
 * -- 2 --
 * Сделать 3 вида оружия (одно стреляет по 1 выстрелу за нажатие и у него есть какое-то кол-во патронов,
 * второе также стреляет по 1 выстрелу за нажатие, но у него бесконечное кол-во патронов,
 * третье стреляет по 3 патрона в ряд за выстрел (т.е. одно нажатие и вылетает три патрона рядышком, как мультишот) и
 * у него соответственно тратится по 3 патрона на выстрел и есть определенное кол-во патронов).
 * Также реализовать смену оружия
 *
 * -- 3 --
 * Реализовать npc – торговца.
 * У него может быть три поведения: он не торгует с игроком, торгует броней, торгует фруктами.
 * Достаточно организовать вывод соответствующего сообщения в консоль. Как активировать торговлю и
 * смену этих состояний – на своей усмотрение (как вариант состояние может сменяться в зависимости от репутации игрока,
 * а активация торговли просто при задевании коллайдера торговца, сильно не усложнять). Можно реализовать вариантом с
 * базовым торговцем и наследниками (т.е. три вида npc, таким образом можно воспользоваться паттерном шаблонный метод)
 *
 * -- 4 --
 * Сделать мини игру. На сцене есть шарики трех типов (красный, белый, зеленый). Их можно заранее заготовить,
 * выложив на сцену в различном количестве. Нужно сделать два условия победы: победил если лопнул все шарики,
 * победил если лопнул шарики только одного цвета. Соответственно перед началом игры можно выбрать какое условие победы
 * хочется использовать. Реализовать это в рамках одной сцены.
 * 
 */